tutorials/modules/multiRegion/film/splashPanel/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sourceCase      "$FOAM_CASE";
constructFrom   patch;

sourcePatches   (surface);
exposedPatchName wall;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

flipNormals     yes;
mergeFaces      no;

linearNormalCoeffs
{
    thickness       0.002;
}

// ************************************************************************* //
